# SetSliderLiveUpdate

## Description
Sets the specified slider to generate events during a drag.

```pascal
PROCEDURE SetSliderLiveUpdate(
				dialogID    : LONGINT;
				componentID : LONGINT;
				liveUpdate  : BOOLEAN);
```

```python
def vs.SetSliderLiveUpdate(dialogID, componentID, liveUpdate):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|componentID|LONGINT|   |
|liveUpdate|BOOLEAN|   |

## Version
Availability: from Vectorworks 2010

## Category
* Dialogs - Modern